[
  {
    "kode": "AALI.JK",
    "nama": "Astra Agro Lestari Tbk.",
    "description": "PT Astra Agro Lestari Tbk engages in the crude palm oil and related derivatives business in Indonesia. The company was founded in 1988 and is headquartered in Jakarta, Indonesia. PT Astra Agro Lestari Tbk is a subsidiary of PT Astra International Tbk.",
    "sector": "Consumer Defensive",
    "industry": "Farm Products",
    "fullTimeEmployees": 27025,
    "website": "https://www.astra-agro.co.id",
    "price": 7375,
    "change": -75,
    "percent": -1.0067114,
    "volume": 390400,
    "currency": "IDR",
    "marketState": "CLOSED",
    "previousClose": 7450,
    "open": 7425,
    "dayHigh": 7425,
    "dayLow": 7350,
    "fiftyTwoWeekHigh": 9000,
    "fiftyTwoWeekLow": 5200,
    "marketCap": 14194576457728,
    "trailingPE": 10.019564,
    "forwardPE": 12.104054,
    "epsTrailingTwelveMonths": 736.06,
    "epsForward": 609.3,
    "beta": 0,
    "dividendRate": 307,
    "dividendYield": 4.12,
    "targetHighPrice": 11700,
    "targetLowPrice": 6160,
    "recommendationMean": 0,
    "revenuePerShare": 14364.278,
    "grossProfits": 4712804909056,
    "profitMargins": 0.05124,
    "sharesOutstanding": 1924688333,
    "bookValue": 12012.934
  },
  {
    "kode": "ABBA.JK",
    "nama": "Mahaka Media Tbk.",
    "description": "PT Mahaka Media Tbk, through its subsidiaries, operates as a multiplatform media company in Indonesia and internationally. It engages in making, selling, collecting, and distributing community contents through various platforms. The company publishes Harian Republika Daily, a Moslem newspaper; Republika Penerbit, which specializes in Islamic books; Mahaka Publishing, which specializes in public books; Alif Republika, which specializes in children's books; Republika Digital Publishing for digital books; Rekomika for comic books; Buku Republika for books in collaboration with a third party; and Harian Indonesia, a Chinese-language newspaper. It also operates Jak TV, a television station; and various commercial radio stations, including NOICE, JAK FM, Gen FM, Gen FM Surabaya, Hot FM, Mustang FM, Most FM, and Kis FM. In addition, the company offers outdoor advertising media services; brand activation, creative agency, and event organizing services; building management, software development, television broadcasting, and communication equipment and general trading services; Web3/NFTs projects; and loyalty program services under the CardPlus name. Further, it provides online services through republika.id, bukurepublika.id, ihram.co.id, and Republika.co.id. The company was formerly known as PT Abdi Bangsa Tbk and changed its name to PT Mahaka Media Tbk in May 2010. PT Mahaka Media Tbk was founded in 1992 and is headquartered in Jakarta, Indonesia.",
    "sector": "Communication Services",
    "industry": "Publishing",
    "fullTimeEmployees": 249,
    "website": "https://www.mahakax.com",
    "price": 49,
    "change": -1,
    "percent": -2,
    "volume": 779500,
    "currency": "IDR",
    "marketState": "CLOSED",
    "previousClose": 50,
    "open": 49,
    "dayHigh": 49,
    "dayLow": 49,
    "fiftyTwoWeekHigh": 97,
    "fiftyTwoWeekLow": 16,
    "marketCap": 192858750976,
    "trailingPE": 0,
    "forwardPE": 0,
    "epsTrailingTwelveMonths": -1.45,
    "epsForward": 0,
    "beta": 0,
    "dividendRate": 0,
    "dividendYield": 0,
    "targetHighPrice": 0,
    "targetLowPrice": 0,
    "recommendationMean": 0,
    "revenuePerShare": 52.443,
    "grossProfits": 75598905344,
    "profitMargins": -0.0276,
    "sharesOutstanding": 3935892857,
    "bookValue": 11.693
  },
  {
    "kode": "ABDA.JK",
    "nama": "Asuransi Bina Dana Arta Tbk.",
    "description": "PT Asuransi Bina Dana Arta Tbk operates as a general insurance company in Indonesia. The company offers car, motor vehicles, fire, personal accident and health, group health, freight, home, property, critical illness, engineering, marine cargo, miscellaneous, travel, and other insurance products. It also provides motor vehicle repair services. The company was founded in 1982 and is headquartered in Jakarta, Indonesia. PT Asuransi Bina Dana Arta Tbk is a subsidiary of Oona Insurance Pte. Ltd.",
    "sector": "Financial Services",
    "industry": "Insurance - Property & Casualty",
    "fullTimeEmployees": 370,
    "website": "https://myoona.id",
    "price": 3200,
    "change": -100,
    "percent": -3.030303,
    "volume": 1200,
    "currency": "IDR",
    "marketState": "CLOSED",
    "previousClose": 3300,
    "open": 3290,
    "dayHigh": 3290,
    "dayLow": 3200,
    "fiftyTwoWeekHigh": 3800,
    "fiftyTwoWeekLow": 2540,
    "marketCap": 1986581233664,
    "trailingPE": 18.939394,
    "forwardPE": 0,
    "epsTrailingTwelveMonths": 168.96,
    "epsForward": 0,
    "beta": 0,
    "dividendRate": 0,
    "dividendYield": 0,
    "targetHighPrice": 0,
    "targetLowPrice": 0,
    "recommendationMean": 0,
    "revenuePerShare": 1676.766,
    "grossProfits": 513105657856,
    "profitMargins": 0.101210006,
    "sharesOutstanding": 35373600,
    "bookValue": 2679.522
  },
  {
    "kode": "ABMM.JK",
    "nama": "ABM Investama Tbk.",
    "description": "PT ABM Investama Tbk, together with its subsidiaries, engages in the coal mining business in Indonesia. The company operates through four segments: Mining and Coal Mining Contractors, Services, Manufacturing, and Other. It offers mining contractor and coal mining and trading services; and electricity solution, integrated logistics, engineering, and development services. The company also designs and manufactures mining heavy equipment support and material transportation equipment, as well as offers fuel and lubricant products. In addition, it provides logistics, domestic sea transportation, stevedoring and seaport, and ship operational services, as well as renewable energy IPP and general trading services. The company was formerly known as PT Adiratna Bani Makmur and changed its name to PT ABM Investama Tbk in August 2009. The company was founded in 2006 and is headquartered in Jakarta, Indonesia. PT ABM Investama Tbk is a subsidiary of PT Tiara Marga Trakindo.",
    "sector": "Energy",
    "industry": "Thermal Coal",
    "fullTimeEmployees": 10560,
    "website": "https://www.abm-investama.com",
    "price": 2810,
    "change": 10,
    "percent": 0.35714287,
    "volume": 482400,
    "currency": "IDR",
    "marketState": "CLOSED",
    "previousClose": 2800,
    "open": 2800,
    "dayHigh": 2850,
    "dayLow": 2800,
    "fiftyTwoWeekHigh": 3620,
    "fiftyTwoWeekLow": 2550,
    "marketCap": 7736393728000,
    "trailingPE": 6.654983,
    "forwardPE": 0,
    "epsTrailingTwelveMonths": 422.24,
    "epsForward": 0,
    "beta": 0,
    "dividendRate": 153,
    "dividendYield": 5.46,
    "targetHighPrice": 0,
    "targetLowPrice": 0,
    "recommendationMean": 0,
    "revenuePerShare": 0.395,
    "grossProfits": 68157800,
    "profitMargins": 0.06415,
    "sharesOutstanding": 2753165000,
    "bookValue": 0.312
  },
  {
    "kode": "ACES.JK",
    "nama": "Aspirasi Hidup Indonesia Tbk.",
    "description": "PT Aspirasi Hidup Indonesia Tbk engages in the retail of home improvement products in Indonesia. It operates through Home Improvement Products, Lifestyle Products, and Toys Products segments. The company retails household and electrical appliances; tools, cleaning equipment, and gardening tools; pet supplies; lifestyle, fashion, beauty, home living, electronics, gadgets, kitchen, dining, hobbies, and craft products; food and beverage products; furniture, shelving and storage, decoration, renovation, automotive, health, and sport products; and children's toys. It also operates retail outlets under the AZKO, ATARU, Pendopo, and Toys Kingdom brands, as well as online shopping sites under the ruparupa brand. In addition, the company engages in trading; transportation and warehousing; and professional, scientific, and technical activities. The company was formerly known as PT Ace Hardware Indonesia Tbk and changed its name to PT Aspirasi Hidup Indonesia Tbk in June 2024. The company was founded in 1995 and is headquartered in Jakarta, Indonesia. PT Aspirasi Hidup Indonesia Tbk is a subsidiary of Kawan Lama Sejahtera, PT.",
    "sector": "Consumer Cyclical",
    "industry": "Specialty Retail",
    "fullTimeEmployees": 14597,
    "website": "https://ahi.id",
    "price": 416,
    "change": -4,
    "percent": -0.952381,
    "volume": 22350500,
    "currency": "IDR",
    "marketState": "CLOSED",
    "previousClose": 420,
    "open": 422,
    "dayHigh": 422,
    "dayLow": 416,
    "fiftyTwoWeekHigh": 815,
    "fiftyTwoWeekLow": 402,
    "marketCap": 7134399954944,
    "trailingPE": 8.963586,
    "forwardPE": 7.2410793,
    "epsTrailingTwelveMonths": 46.41,
    "epsForward": 57.45,
    "beta": 0,
    "dividendRate": 33.87,
    "dividendYield": 8.06,
    "targetHighPrice": 860,
    "targetLowPrice": 450,
    "recommendationMean": 1.82353,
    "revenuePerShare": 504.889,
    "grossProfits": 3898552090624,
    "profitMargins": 0.09195,
    "sharesOutstanding": 17150000000,
    "bookValue": 372.489
  }
]